//******************************************************************************
//
// Файл         : ./f103c8t6_1a/AuxiliaryUnits.h
//
// Дата         : 31 марта 2019 г.
// Описание     : TODO Заголовочный файл проекта f103c8t6_1a.
// Назначение   :
//
//
// Лицензия     : Creative common 3.0
//
// Автор Ardt2 (c) 2019
//
//******************************************************************************

#ifndef __AuxiliaryUnits_H
#define __AuxiliaryUnits_H


// Укажи здесь включаемые(заголовочные и инлайн) файлы, необходимые в этом файле.
// Не полагайся на то, что они будут включены перед этим файлом где-то еще.
// ----------------------------------------------------------------------------
#include <stdint.h>
#include <limits>


// Укажи здесь включаемые(заголовочные и инлайн) файлы, необходимые в каждом
// файле проекта, кроме тех, что уже указаны выше.
// Проверь пути к включаемым файлам в настройках проекта.
// ----------------------------------------------------------------------------


// Укажи здесь объявления типов общих для всего проекта переменных.
// ----------------------------------------------------------------------------
template<typename T, T bits> class _uintnbits_t
{
    private:
        T Num;

    public:
        _uintnbits_t() {}
};


// ============================================================================
template<typename T, T mod>
class _uintmod_t // : public uinit32_t – так не получится, увы.
{
    private:
        T Num;

    //
    public:
        _uintmod_t(T i)
        {

        }
};

// Число по модулю.
// ============================================================================
template<unsigned char module>
struct _unsignedmod
{
    unsigned char x;


};


// ============================================================================
template<unsigned char bits, unsigned char maxinbits = 8>
struct _wordbits
{
    // Тут нужен static_assert(maxinbits > bits);
    // ========================================================================
    unsigned short x;

//    const unsigned short maxnumber = powint(2, bits);
//    const float ratio = (float)maxnumber / (float)powint(2, bits);


};

// ----------------------------------------------------------------------------
typedef _wordbits<6> Word6bit;


// Укажи здесь "extern" объявления общих для всего проекта переменных.
// ----------------------------------------------------------------------------



// Укажи здесь включаемые файлы взаимодействия с системами проекта
// ----------------------------------------------------------------------------


// ============================================================================
// ----------------------------------------------------------------------------
// TODO




#endif //__AuxiliaryUnits_H
